Revit 2026 API

# ElementId Methods

---

The ElementId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares two element ids. |
|  | CompareTo | Compares two element ids. Implementation of System.IComparable interface |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the value of the id as hash code (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Parse | Parse the string representation of the id into a corresponding ElementId. |
|  | ToString | Gets a String representation of the value of the id. (Overrides ObjectToString) |
|  | TryParse | Parse the string representation of the id into a corresponding ElementId. |

#### Reference

ElementId Class

Autodesk.Revit.DB Namespace